app/controllers/receipts_controller.rb

SELECT "receipts".* FROM "receipts"
---
  def index
    @receipts = Receipt.all

INSERT INTO "receipts" ("location", "date", "amount", "type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["location", "DC"], ["date", Tue, 04 Apr 2017], ["amount", #<BigDecimal:7fea140a01a8,'0.2E1',9(18)>], ["type", ""], ["created_at", 2017-04-04 22:34:17 UTC], ["updated_at", 2017-04-04 22:34:17 UTC]]
---
  def create
    @receipt = Receipt.new(receipt_params)

    respond_to do |format|
      if @receipt.save

DELETE FROM "receipts" WHERE "receipts"."id" = ?  [["id", 1]]
---
  def destroy
    @receipt.destroy

SELECT  "receipts".* FROM "receipts" WHERE "receipts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_receipt
      @receipt = Receipt.find(params[:id])